#define   _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//int main()
//{
//	int i = 0;
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	//for (i = 0; i < 12; i++)
//	//{
//	//	arr[i] = 0;
//	//	printf("hehe\n");
//	//} 
//
//	printf("%p\n", arr[9]);
//	printf("%p\n", i);
//
//
//	//char     //字符数据类型
//	//short    //短整型
//	//int      //整形
//	//long     //长整型
//	//long long//更长的整形
//	//float    //单精度浮点型
//	//double   //双精度浮点型
//
//
//
//	return 0;
//}


//int main()
//{
//	//int a = -10;
//	//int b = 10;
//	int a = 0x11223344;
//	//    高位字节   低位字节
//
//	//大端字节序：低字节放在高地址
//	//小端字节序：低字节放在低地址
//
//
//	return 0;
//}




//设计一个小程序，判断当前机器的字节序
//int check_system(char* p)
//{
//	return *p == 1 ? 1 : 0;
//}
//int main()
//{
//	int a = 1;
//	char* p = (char*) & a;
//	printf("%d\n", check_system(p));
//	return 0;
//}


//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111111
//	//11111111
//	signed char b = -1;
//	unsigned char c = -1;
//	//00000000000000000000000011111111
//
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	//      -1    -1        
//	return 0;
//}



//int main()
//{
//	char a = -129;
//	//00000000000000000000000010000000
//	//10000000-a(char)
//
//
//
//	printf("%u\n", a);
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	//10000000 00000000 00000000 00010100   -i
//	//11111111 11111111 11111111 11101100
//	unsigned int j = 10;
//	//00000000 00000000 00000000 00001010   -j
//
//	//i+j
//	//11111111 11111111 11111111 11110110
//	//10000000 00000000 00000000 00001010   (-10)
//	printf("%d\n", i + j);
//	printf("%u\n", i + j);
//}

//int main()
//{
//	unsigned int i;
//
//	//9:00000000 00000000 00000000 00001001
//	//....
//	//0:00000000 00000000 00000000 00000000
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		//9 8 7 6 5 4 3 2 1 0
//	}
//	return 0;
//}


int main()
{
	char a[1000];
	int i;
	for (i = 0; i < 1000; i++)
	{
		a[i] = -1 - i;
	}
	printf("%d", strlen(a));
	return 0;
}