#define   _CRT_SECURE_NO_WARNINGS
# include <stdio.h>

//int main()
// 
//整型提升
// 
////对于有符号位的，整型提升 高位复制符号位
////无符号位，整形提升 高位补零
//{
//	//表达式中各种长度可能小于int长度的整型值，都必须先转化为int 或者unsigned int，然后再送往CPU计算
//
//	char a = 3;//char型只有8位：0000 0011
//	char b = 127;//0111 1111
//	char c = a + b;
//	//整形提升后
//	//0000 0000 0000 0000 0000 0000 0000 0011
//	//0000 0000 0000 0000 0000 0000 0111 1111
//	// a + b = 0000 0000 0000 0000 0000 0000 1000 0010
//	//c中为char型，再次截断为 1000 0010
//
//	printf("%d\n", c);//-126
//
//	//这里打印的是整形，而c为char型，所以c也要发生整型提升为：1111 1111 1111 1111 1111 1111 1000 0010
//	// c的原码：1000 0000 0000 0000 0000 0000 0111 1110————  -126
//	//发现ab都是char型不够int整形值，所以会造成 整型提升
//
//
//	return 0;
//}


//int main()
//{
//	char a = 0xb6;
//	short b = 0xb600;
//	int c = 0xb6000000;
//	if (a = 0xb6)
//		printf("a");
//	if (b = 0xb600)
//		printf("b");
//	return 0;
//}


//int main()
//
////算术转换(向上转换)
//
//{
//	int a = 4;
//	float b = 4.5f;
//	a + b;//算术转换
//
//	return 0;
//}








int mian()
{
	int a = 9;
	int b = 7;
	//int c = a + b * 7;//*优先级高于+的优先级，决定了运算顺序
	int c = a + b + 3;//优先级不起作用，结合性决定顺序
	return 0;
}